tests/interFSFFoam/dropletRelaxation/src/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - always create both halves in one invocation with correct 'neighbourPatch'
//   setting.
// - optionally pointSync true to guarantee points to line up. 

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - in polyMesh/boundary file:
//      - loosen matchTolerance of all cyclics to get case to load
//      - or change patch type from 'cyclic' to 'patch'
//        and regenerate cyclic as above

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {   
        // Name of new patch
        name cyclic1;

        // Dictionary to construct new patch from
        patchInfo
        {   
//             type cyclic;
            type symmetryPlane;
            neighbourPatch cyclic2;

            // Optional: explicitly set transformation tensor.
            // Used when matching and synchronising points.
            // transform rotational;
            // rotationAxis (1 0 0);
            // rotationCentre (0 0 0);
//             transform translational;
//             separationVector (0 0.1 0);

            // Optional non-default tolerance to be able to define cyclics
            // on bad meshes
            //matchTolerance 1E-2;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (bufferPatchForCyclic1);

        // If constructFrom = set : name of faceSet
//         set f0;
    }
    {
        // Name of new patch
        name cyclic2;

        // Dictionary to construct new patch from
        patchInfo
        {
//             type cyclic;
            type symmetryPlane;
            neighbourPatch cyclic1;

            // Optional: explicitly set transformation tensor.
            // Used when matching and synchronising points.
            // transform rotational;
            // rotationAxis    ( 0 0 1 );
            // rotationCentre  ( 0.3 0 0 );
//             transform translational;
//             separationVector (0 -0.1 0);
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (bufferPatchForCyclic2);

        // If constructFrom = set : name of faceSet
//         set f0;
    }
);
