tests/interFSFFoam/dropletRelaxation/src/constant/src/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// buoyancyForce
// {
//     type        buoyancyForce;
// }

VoFClouds
{
    type    VoFClouds;

    libs    ("libVoFClouds.so");

    phase   liquid;
    carrierPhase liquid;
}

// ************************************************************************* //
