tests/interFSFFoam/dropletRelaxation/src/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (liquid gas);

pMin                pMin                [ 1 -1 -2 0 0 0 0 ] 10000;

// sigma               sigma               [ 1 0 -2 0 0 0 0 ]  0.072;

sigma
{
    type    liquidProperties;
    phase   liquid;
}

// sigma
// {
//     type    temperatureDependent;
//     sigma   table
//     (
//         (273.15 0.02410053)
//         (370.00 0.01562685)
//     );
// }

heaterRadius        heaterRadius        [ 0 1 0 0 0 0 0 ]   0.002;

// modeNumber          modeNumber          [ 0 0 0 0 0 0 0 ]   2;
// oscillationNumber   oscillationNumber   [ 0 0 0 0 0 0 0 ]   100;
// t_start             t_start             [ 0 0 1 0 0 0 0 ]   0;
// p_0                 p_0                 [ 1 -1 -2 0 0 0 0 ] 1e5;
// rhol_0              rhol_0              [ 1 -3 0 0 0 0 0 ]  1000.0;
// gamma               gamma               [ 0 0 0 0 0 0 0 ]   1.4;
// //0.05 + 0.05 = 0.1
// r_p_inlet           r_p_inlet           [ 0 0 0 0 0 0 0 ]   0.1;
// r_p_inlet_start     r_p_inlet_start     [ 0 0 0 0 0 0 0 ]   0.1;
// omega               omega               [ 0 0 -1 0 0 0 0 ]  3086896.454289302;
// alpha               alpha               [ 0 0 -1 0 0 0 0 ]  5000;

// ************************************************************************* //
