tests/interFSFFoam/dropletRelaxation/src/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// limitTemperatureGas
// {
//     type            limitTemperature;
// 
//     selectionMode   all;
// 
//     phase           gas;
// 
//     min             250;
//     max             500;
// }
// 
// limitTemperatureLiquid
// {
//     type            limitTemperature;
// 
//     selectionMode   all;
// 
//     phase           liquid;
// 
//     min             250;
//     max             500;
// }
// 
// limitp
// {
//     type       limitPressure;
// 
//     min             1e4;
//     max             1e6;
// }

// stabilisation
// {
//     type            phaseLimitStabilisation;
//     field           alpha.liquid;
//     rate            rAlpha.liquid;
//     residualAlpha   1e-3;
// }

// ************************************************************************* //
